&НаКлиенте
Процедура ПриОткрытии(Отказ)
	LogBookОбщегоНазначенияКлиент.ЗаполнитьПериодИзДаты(Период,Объект.ДатаНачала,Объект.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	LogBookОбщегоНазначенияКлиент.ЗаполнитьДатыИзПериода(Период,Объект.ДатаНачала,Объект.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата()
	КонецЕсли;
КонецПроцедуры
